Repository: necrose99/Myaamia
Catalog: Word-List-Dictionary/sac_full_cleaned.tmx
Source language: en_us
Languages: sac

source: p an.
sac: ahkwâwishimêwa fill u

source: snarl;
sac: âhkwâpitêwishimowa

source: at
sac: ahkwichipîthehkâhi co

source: wrap
sac: ahpahôni (woman’s) hair

source: hole t
sac: âhpechi âhpechi- , the w

source: for all
sac: the time; for good, once and

source: er of t
sac: ahpenîthowa be a memb

source: I’m P
sac: netahpenîtho Potato clan;

source: ) pot
sac: ahpenya ahpenyêki (pl.:

source: m
sac: akikwâha phleg

source: â/ê ( )
sac: akikwâpyêwa

source: TIONA
sac: 22 A C D ONCISE IC

source: an.
sac: akimêwa count

source: inan.
sac: akitamwa count

source: nt
sac: akitâthowa cou

source: hook
sac: akôchikani pot

source: the gr
sac: akôna snow (on

source: a me
sac: akônithowa be

source: o I’m
sac: netakônith clan;

source: a rest
sac: âkwapiwa take

source: h Neg
sac: âkwi no; not (wit

source: ck no!
sac: âkwi châhi! he

source: êkôh
sac: âkwi (châhi) k

source: much
sac: âkwi mâne not

source: never
sac: âkwi nanâshi

source: bedsprea
sac: akwîweni wrap, robe;

source: wa ) bea
sac: amehkwa omehk (or

source: 23 E
sac: S L OF THE AUK ANGUAG

source: member
sac: amehkwithowa be a

source: witho I’
sac: netamehk Beaver clan;

source: ick to rea
sac: amêthiwa be alert, qu

source: tâni uld;
sac: âmi- would, should, co

source: ow woul
sac: âmishimehkamâni? h

source: nd it?
sac: get there?, how could I fi

source: ahtôwa
sac: amokwîweni cancer;

source: cancer
sac: amokwîweni (s)he has

source: wi
sac: amwêwa am eat an.;

source: he beans!
sac: mashkochîthaki! eat t

source: dish, bow
sac: anâkani nâkani (or )

source: wathi
sac: anâkowe â yesterday;

source: yesterd
sac: anâkowe the day before

source: kâta rried;
sac: netânemitêhe I’m wo

source: ’t worry!
sac: ânemitêhêhkani! don

source: 25 E
sac: S L OF THE AUK ANGUAG

source: American,
sac: Anenôtêwa a Native

source: a dip; tak
sac: anenwîwa bathe, take

source: ho
sac: Anêpahôha an Arapa

source: , record in
sac: anepyêhamwa write

source: ite
sac: anepyêhâthowa wr

source: rite to an.
sac: anepyêhikawêwa w

source: ay, way of
sac: anika away, further aw

source: et lost!;
sac: anika’hâno! get out!, g

source: âhi ) way
sac: anikâ’nâhi nikô’n (or

source: can’t
sac: ashkachi- be impatient to,

source: want
sac: ketashkachinepa? do you

source: r
sac: ashkachitêhêwa be eage

source: t
sac: ashkatethiwa be impatien

source: w
sac: ashkikenwi (it)’s fresh, ne

source: new
sac: ashkikiwa be young, fresh,

source: gree
sac: ashkipakinîkwêwa have

source: ice c
sac: âshkwîmi êshkwîmi (or )

source: cram
sac: atâhkwêpithowa have a

source: cra
sac: netatâhkwêpitho I’ve got a

source: ir
sac: fair hair, light-brown ha

source: w, orange
sac: athâwâwi (it)’s yello

source: ow, orang
sac: athâwethiwa be yell

source: carrot
sac: athâwochêpihkyêni )

source: moccasin
sac: athayimahkethêhi

source: buckskin
sac: athayimekôtêweni

source: athem .;
sac: athemihêwa help an

source: hi? can y
sac: kekashkathemi help!;

source: ! please h
sac: kîhathemihi help me?;

source: ’ll help y
sac: kîhathemihene me!; I

source: ARY
sac: 30 A C D ONCISE ICTION

source: out, lend
sac: athemihiwêwa help

source: i ) rock, s
sac: atheni athenyên (pl.:

source: an. in pla
sac: athêwa have an.; put

source: eechclout
sac: âthiyâni loincloth, br

source: be shor
sac: chahchahkwinêmowa

source: rst wor
sac: châhi so (usually follows fi

source: ave a s
sac: chakânaketonwa -/e ( ) h

source: cao, co
sac: châkanetîhi chocolate, ca

source: soaked
sac: châkawishinwa -/e ( ) be

source: gbird
sac: châkênâtowêha mockin

source: small
sac: chaketonwa -/e ( ) have a

source: ly
sac: châki châki- , all, complete

source: all nose
sac: chakikomêwa have a sm

source: ith the
sac: êyêh- while (w

source: ANGUA
sac: S L OF THE AUK

source: before
sac: êyêhpwâwi-

source: d)
sac: Conjunctive moo

source: kay
sac: haw all right, o

source: why!
sac: hay! come on!,

source: upper
sac: -hkâhki chest,

source: kâta
sac: -hkâchi -h (pl.:

source: ck
sac: -hkwêkani ne

source: y
sac: hô all right, oka

source: -ht l.:
sac: -htawakayi (p

source: what
sac: hwa? wa? (or )

source: ICTIONARY
sac: 38 A C D ONCISE

source: sses dismay
sac: î! oh no! (expre

source: eg.) go the
sac: ihêwa â/ê ( ; irr

source: nîhkâna ;
sac: -îhkâna friend

source: owîh iend;
sac: kîhkâna your fr

source: nîhkâne!
sac: his/her friend(s);

source: y friends!
sac: nîhkânetike! m

source: that
sac: ihketowa say

source: ihkwê an;
sac: ihkwêwa wom

source: ladies!
sac: ihkwêwetike! )

source: nîki e; my
sac: -îki house, hom

source: /her home;
sac: owîki home; his

source: e (an.); (s)
sac: îna that, that on

source: who’s that?
sac: châh îna? (so)

source: e
sac: înâhi over ther

source: ANGUAGE
sac: S L OF THE AUK

source: ost that (a
sac: inakimowa c

source: etâthwi
sac: kâshôhêha m

source: e kitten co
sac: inakimowa th

source: costs that
sac: inakitêwi (it)

source: nînan ue;
sac: -înaniwi tong

source: that color;
sac: inâtêwi (it)’s

source: what color
sac: owînethani?

source: that color
sac: inâthowa be

source: peak that
sac: inâtowêwa s

source: nînêtep ;
sac: -înêtepi brain

source: her brain
sac: owînêtepi his/

source: hair, hea
sac: -înethani (pl.)

source: owîn hair;
sac: nînethani my

source: ) hair, stra
sac: -înethi (single

source: o r strand;
sac: nînethi my hai

source: and
sac: his/her hair str

source: sent, gone
sac: inêtwa be ab

source: D ICTIONARY
sac: 40 A C ONCISE

source: say to, tell
sac: inêwa n/sh ( )

source: ishi! tell him
sac: wîhpîtikêch

source: ne (inan.)
sac: îni that, that o

source: that’s it!, tha
sac: îni! înê! (or )

source: ose ones (an
sac: îniki those, th

source: t’s right!
sac: îni kohê! tha

source: e I think so
sac: îni mêkwêh

source: at that time,
sac: îninâhi then,

source: ose ones (in
sac: înini those, th

source: îni tathwê r
sac: îni tathwi (o

source: ould be, gue
sac: îni yêtoke c

source: y that way;
sac: inowêwa sa

source: châh ênow
sac: ___? tâni (or

source: nâh y ___?;
sac: how do you sa

source: in!
sac: inowêno! say it aga

source: i ) too
sac: -îpichi -îpitan (pl.:

source: ow
sac: -îpikani bone marr

source: UAGE
sac: S L OF THE AUK ANG

source: way;
sac: ishawiwa act that

source: re yo
sac: keteshawi? what a

source: în ês
sac: what are you up to?;

source: âk ;
sac: that’s what I’m doing

source: not up
sac: êshawiyânini I’m

source: p
sac: -îshehkwayi scal

source: at ma
sac: ishi- that way, in th

source: y hea
sac: -îshi nîshi head; m

source: ok lik
sac: ishinâkothiwa lo

source: that w
sac: ishitêhêwa think

source: at’s w
sac: în êshitêhêyâni th

source: that’s
sac: în êshitêhêwâchi

source: e an.;
sac: kâshkahonêwa shav

source: ave yo
sac: kîhkâshkahone I’ll sh

source: onesel
sac: kâshkahowa shave (

source: bstinat
sac: kashkatethiwa be o

source: ar an.
sac: kâshkehtawêwa he

source: 45 E
sac: S L OF THE AUK ANGUAG

source: buy, e
sac: kashkihêwa acquire,

source: shkih
sac: nenatawêneta kîhka

source: to do,
sac: kashkihtôwa be able

source: inan.;
sac: inan.; acquire, buy, earn

source: ive mo
sac: kâta not (with Prohibit

source: snowin
sac: kehchimehpowi it’s

source: over the
sac: kehchine a little way

source: be fast
sac: kehchinepêwa â/ê ( )

source: e’s a stor
sac: kehchinôtenwi ther

source: run
sac: kehchipenowa jog,

source: le up, fa
sac: kehchîpithowa buck

source: e’s belt
sac: one’s seat belt; do up on

source: 47 E
sac: S L OF THE AUK ANGUAG

source: it’s a tor
sac: kehchiwâyâthowa

source: tornado;
sac: kehchiwâyâthowa

source: yêwa
sac: kehchiwâyâthowa p

source: irst wor
sac: kêhi and, but (follows f

source: nekya a
sac: mana kêhi sentence);

source: bull
sac: kêkineshîha bull; buffalo

source: ing
sac: kekisheyêpa in the morn

source: r, box; chest
sac: kekithechinikani drawe

source: in the water
sac: kekôpyêshinwa -/e ( ) lie

source: schoolhouse,
sac: kekyêhkimâthohikâni

source: pil, student
sac: kêkyêhkimâthochiki ) pu

source: enâmi-
sac: kekyêhtenâmi kekyêht ,

source: thout a
sac: really, definitely, for sure, wi

source: -witted, stupi
sac: kekyêpâtethiwa be dim

source: eshêwa ) be
sac: kekyêpeshêwa kep (or

source: êmika
sac: kêmiyâki kêmiyâki py rain;

source: enâch
sac: kenâchi kenâchi- k , slowly;

source: slowly
sac: kîhthâkiwâtowe please speak

source: down
sac: kenâchipahônekowa slow

source: me!
sac: kênemâpi who knows?, beats

source: cough,
sac: kenîkitêhêwa cough; have a

source: a tickl
sac: kenîkikotâkanwa -/e) ( have

source: âchî
sac: Kêtôha Kanakan (or

source: s, me
sac: ketômikatwi (it) say

source: es it
sac: ketômikatwi? what do

source: hâh
sac: ketowa kashi c say;

source: ago; i
sac: keyêchîhi a moment

source: nekî
sac: -kîha mother’s sister;

source: i his/
sac: okîhan mother’s sister;

source: nê or
sac: neki! mother’s sister; (

source: peaki
sac: kî’hkâ! oh no! (male s

source: keep n
sac: kîhkîpekwashiwa

source: a toot
sac: kîhkîtâpitêwa have

source: (from
sac: kîhpochêwa be full

source: o
sac: Kîkâpôwa a Kickapo

source: east; f
sac: kîkênôni clan feast, f

source: st
sac: kîkênoweni clan fea

source: be sn
sac: kîmôchitanekowa

source: sh on
sac: kôkâpitêhowa bru

source: was
sac: kôkenikêwa do the

source: ) wa
sac: kôkinechêwa â/ê (

source: your
sac: kôkinechâno! wash

source: or
sac: kôkôtenîha alligat

source: AGE
sac: S L OF THE AUK ANGU

source: g, bul
sac: konwâshkêha fro

source: (Okl
sac: Koshineki Cushing

source: be bo
sac: koshkwâtethiwa

source: r an.
sac: kotaka another, othe

source: year
sac: kotakawahîne last

source: e )
sac: nîkâni kotakawahîn

source: inan
sac: kotaki another, other

source: ) be
sac: kothekwanwa -/e (

source: ekot
sac: takâwi k overweight;

source: vy
sac: kothekwanôki they’re hea

source: hy, ti
sac: kothethiwa be bashful, s

source: d of,
sac: kothêwa th/sh ( ) be afrai

source: -dic
sac: kothikêwa play bowl-and

source: be s
sac: kwahkwâpitanekowa

source: p, di
sac: kwâpahikani ladle, scoo

source: out,
sac: kwâshkwithahêwa let

source: or, lo
sac: kwînomêwa miss; pine f

source: you;
sac: kekwînomene an.; I miss

source: iss y
sac: kekwînomenepena we m

source: itho I’m
sac: nemahwêw Wolf clan;

source: /e ) have a
sac: makânaketonwa - (

source: potbelly
sac: makechêwa have a

source: big, large;
sac: makekinwa -/e ( ) be

source: g;
sac: kemakekine you’re bi

source: g
sac: makekinôki they’re bi

source: g ears
sac: makeshêwa have bi

source: a big nose
sac: makikomêwa have

source: -/e ) have
sac: makinehpetonwa (

source: aned (sai
sac: i.e. have been overly we

source: bottle too
sac: child that’s been on the

source: ê ) be grow
sac: makinehpyêwa â/ (

source: ain, large
sac: makwahkiwi mount

source: e a swollen
sac: makwikanêwa hav

source: îkiyâp
sac: mehtami mehtami w first;

source: house
sac: wêchinamachîyani the first

source: woods,
sac: mehtekwahkihkîki in the

source: ; beam;
sac: mehtekwi tree; wood; stick

source: bowl
sac: mehtekwinâkani wooden

source: o, colli
sac: mehteshkamwa bump int

source: to, coll
sac: mehteshkawêwa bump in

source: like;
sac: mehtôchi it seems, it looks

source: ki
sac: mehtôchi meko âkwi pêh

source: wêwen
sac: kehkênetakini Thâkiwâto

source: y know
sac: it looks like (s)he doesn’t reall

source: aple syru
sac: menêshishi syrup; m

source: 71 E
sac: S L OF THE AUK ANGUAG

source: ashamed,
sac: mêneshitêhêwa be

source: ring
sac: menôhkamîwi it’s sp

source: êkôhi?
sac: kashkimenohkâha k

source: o drink?
sac: could I have something t

source: fair deal,
sac: menwakimowa be a

source: od eyesig
sac: menwâpiwa have go

source: ood vision
sac: nemenwâpi I’ve got g

source: i I don’t s
sac: pashi menwâpiyânin

source: endly
sac: myânâtethiwa be unfri

source: doin
sac: myânâshkêwi (it)’s not

source: to the
sac: well; (it)’s upset (referring

source: eferri
sac: stomach); (it)’s irregular (r

source: ugly
sac: myâshinâkothiwa be

source: mean
sac: myâshinîkwêwa have

source: not fe
sac: myâshipemâtethiwa

source: feel b
sac: myâshitêhêwa be sad,

source: treet
sac: myêwi way, path, road, s

source: be abl
sac: nahaniwithêwa â/ê ( )

source: dgea
sac: nahâtethiwa be knowle

source: clim
sac: nahâthîwa know how to

source: nd sunny
sac: nahâwiwi it’s warm a

source: ge inan.; p
sac: naheshkamwa arran

source: able to, ca
sac: nahi- know how to, be

source: well now; r
sac: nahi nahê! (or ) hey!;

source: how to swi
sac: nahichimêwa know

source: on time;
sac: nâhinâhi at that time,

source: ht on time
sac: kwîyena nâhinâhi rig

source: nâhkachi
sac: nâhkachi again; and;

source: ain!;
sac: kîhnêwone! see you ag

source: 81 E
sac: S L OF THE AUK ANGUAG

source: pwa!
sac: nâhkachi kîhnêwone

source: n)
sac: (to more than one perso

source: all (of time
sac: nahkani- throughout,

source: ay
sac: nahkanikîshekwi all d

source: rakes, step
sac: nakahikêwa hit the b

source: i ) dish,
sac: nâkani anâkan (or

source: leave, a
sac: nakanêwa n/sh ( )

source: follow
sac: nâkanêwa n/sh ( )

source: aband
sac: nakatamwa leave,

source: , guts; e
sac: -nakeshi intestines

source: e, stop
sac: nakeshkêwa brak

source: ops goi
sac: nakeshkêwi (it) st

source: rt stop
sac: nakeshkêwi my hea

source: eet, bu
sac: nakishkawêwa m

source: NARY
sac: 82 A C D ONCISE ICTIO

source: stop; st
sac: nakithachikêwa

source: chine)
sac: (as of a vehicle or ma

source: an. (a
sac: nakithahêwa stop

source: , leave,
sac: nâkwêwa â/ê ( ) go

source: to
sac: nîhnâkwâpena we’ve got

source: en
sac: including the person(s) spok

source: wâ
sac: kîhnâkwâpena! nâk (or

source: on(
sac: let’s go! (including the pers

source: wa
sac: nâkwâno! spoken to); go a

source: on
sac: namachîneki to the left,

source: ft
sac: kenamachîneki to your le

source: th
sac: namathowa stand, stand

source: d u
sac: namathwikâpâwa stan

source: ins
sac: nâmeki nâmeki- , on the

source: pan
sac: nâmekikepwitîhi under

source: ers
sac: nâmekipîthehkâhi und

source: get
sac: nanâhawiwa get ready;

source: e,
sac: nanâhikwêhikêwa driv

source: rooster
sac: neniwipakahâhkwâha

source: d an.;
sac: nenohtawêwa understan

source: ’t unde
sac: âkwi nenohtônânini I don

source: o you
sac: kenenohtawi? stand you; d

source: a ) a N
sac: Nenôtêwa Anenôtêw (or

source: i ) cow
sac: nenothwa nenothôk (pl.:

source: ld
sac: nepachiwa be cold, get co

source: sleep;
sac: nepêwa â/ê ( ) sleep, go to

source: , in third
sac: nêthônameki third

source: hundred
sac: nethwâhkwe three

source: 89 AGE
sac: S L OF THE AUK ANGU

source: ee years
sac: nethwawahîne thr

source: hree an.
sac: nethwihêwa have t

source: pôtwe
sac: nêwêwa ka see an.;

source: ou later
sac: kîhnêwone I’ll see y

source: hnêwon
sac: kapôtwe kî person);

source: on)
sac: (to more than one pers

source: nenîch
sac: -nîchânetha child;

source: children
sac: mâhaki these are my

source: na )
sac: nîhkâna -îhkâ (see

source: nâhi ) w
sac: nikâ’nâhi nikô’ (or

source: t year
sac: nîkânawahîne nex

source: ad, up ah
sac: nîkâni in future; ahe

source: !, what a pity!
sac: ôhwâ! yôhwâ! (or ) man

source: ration, or
sac: (expresses tiredness, exaspe

source: ef
sac: okimâwa chief, tribal chi

source: oma City
sac: Okonohômîheki Oklah

source: ry
sac: ômîni ômini (or ) blueber

source: g powder
sac: opishkwêthikani bakin

source: nôshithema
sac: -ôshithema grandchild;

source: ani his/her
sac: ôshithem my grandchild;

source: child!
sac: nôshîhi! grandchild; grand

source: of a female:) b
sac: oshkashîhkwêwiwa (

source: a Shkasha
sac: netoshkashîhkwêwi I’m

source: le:) be a
sac: oshkashîwiwa (of a ma

source: l
sac: pâkahatowêwa play bal

source: kâ
sac: pakithâhkwiwa give up;

source: give
sac: pakithâhkwihkani! don’t

source: n ina
sac: pakithenamwa put dow

source: let g
sac: pakithenêwa put down,

source: dcat
sac: pakwachikâshôha wil

source: ffal
sac: pakwachinenothwa bu

source: ny
sac: panakîha kernel of homi

source: kât
sac: panenamwa drop inan.;

source: t!
sac: panenâhkani! don’t drop i

source: (referring
sac: pâthikithenwi (it) forks

source: o an. (for
sac: pehchimêwa say sorry t

source: mene I’
sac: kepehchi something said);

source: rry to an.
sac: pehchitôtawêwa say so

source: itôtône
sac: kepehch something done);

source: you)
sac: I’m sorry (for what I did to

source: ery; very
sac: pêhki pêhki meko (or ) v

source: speaking)
sac: pêhkî’hkâ! oh no! (male

source: ht gravy
sac: pêhkikeshânâpowi lig

source: kep ng;
sac: pehtowêwa be wro

source: ehtowê
sac: kep you’re wrong (pl.:

source: ky, hazy
sac: pekeshêwi it’s smo

source: speak aw
sac: pekishkâtowêwa

source: hion
sac: speak in a muddled fas

source: tting rou
sac: pekishkyâwi it’s ge

source: ead
sac: pêkotêhi cowboy br

source: irsty
sac: pêkwitêhêwa be th

source: together,
sac: pemâkwapiwa sit

source: o! come
sac: pemâkwapin group;

source: ive
sac: pemâtethiwa be al

source: sh ) pass
sac: pemehkânêwa n/ (

source: walk by,
sac: pemehkêwa â/ê ( )

source: care of in
sac: pemenamwa take

source: re of an.
sac: pemenêwa take ca

source: ve lost on
sac: pepeshkwitepêwa ha

source: Y
sac: 104 A C D ONCISE ICTIONAR

source: Oriental
sac: Pêpîwinîkwâhichiki ) an

source: overshoe
sac: pepônwimahkethêhi

source: nison, de
sac: peshekethiwa deer; ve

source: e a mem
sac: peshekethiwithowa b

source: thiwith
sac: nepesheke the Deer clan;

source: venison,
sac: peshekethiwiwîyâthi

source: straightf
sac: peshikwâchimowa be

source: the truth;
sac: ward, truthful; be speaking

source: elling it a
sac: nepeshikwâchimo I’m t

source: ânet
sac: netâhe! net daughter(s); (or

source: whe
sac: tâni? which (inan.)?, what?,

source: ime?
sac: tâninâhi? when?, at what t

source: be in
sac: tanwâchipemâtethiwa

source: agon
sac: tâpyâna atâpyâna (or ) w

source: , bree
sac: tâthiyâni diapers; loincloth

source: years
sac: tathwawahîne that many

source: y an.
sac: tathwihêwa have that man

source: waki
sac: nekotwâshika netathwihâ

source: hildren
sac: nenîchânethaki I have six c

source: t many
sac: tathwipepônwêwa be tha

source: (s)he’s
sac: nekoti tathwipepônwêwa

source: i ayô
sac: tawânahi tawânah if only;

source: hope s
sac: tawânahi kêhtena I sure

source: horse;
sac: -taya -tayêki (pl.: ) pet, dog,

source: her pet(
sac: netaya otayêni my pet; his/

source: cold m
sac: têhkyâki miniki ice cream;

source: pêhki
sac: tepânêwa n/sh ( ) love an.;

source: much;
sac: ketepânene I love you very

source: pêh me;
sac: netepânekwa (s)he loves

source: er a lot;
sac: netepânâwa I love him/h

source: doesn’t
sac: pashi tepâshichini (s)he

source: nwi-
sac: tepehkîwi me it’s night;

source: ight;
sac: tepehkîwi it’s a beautiful n

source: ddle of
sac: nâwitepehkîwi it’s the mi

source: kîwi it’s
sac: kîshinâwitepeh the night;

source: dnight
sac: late in the night; it’s after mi

source: n
sac: tepehkikîshethwa moo

source: ach inan.;
sac: têpeshkamwa attain, re

source: wikenw
sac: men (number of years old);

source: birthday!;
sac: êhtêpeshkamani! happy

source: awahîne
sac: înoki nyêwâpitaki tathw

source: turned 40
sac: êhtêpeshkamâni today I

source: that’s) en
sac: têpi têpi- têpi! , enough; (

source: the gratit
sac: têpihêwa please an., earn

source: ks; I’m
sac: ketêpihi of an.; than

source: ease m
sac: you (literally, ‘you pl

source: ateful t
sac: ketêpihipwa I’m gr

source: net );
sac: more than one person

source: have h
sac: têpikîhpochêwa

source: fill
sac: eat), have eaten one’s

source: raight
sac: tepinâhi straight, st

source: tance (
sac: têpinâhi a short dis

source: (of an
sac: têpitathwi enough

source: âkani
sac: têpitathwi thîweht

source: elieve
sac: têpwêhtawêwa b

source: you be
sac: ketêpwêhtawi? do

source: lieve y
sac: ketêpwêhtône I be

source: on’t be
sac: têpwêhtônânini I d

source: be telli
sac: têpwêwa be right,

source: the tru
sac: netêpwe I’m telling

source: be dizz
sac: tetepeshkwêwa

source: bicycle,
sac: têtepithâha wheel, tire;

source: adache
sac: têwehkwêwa have a he

source: n Englis
sac: Thâkanâsha a Briton, a

source: oors
sac: thâkichi outside, out of d

source: o the to
sac: thâkichihêwa â/ê ( ) go t

source: o you h
sac: kîhthâkichiha? outside; d

source: et/restro
sac: thâkichîwa go to the toil

source: e got to
sac: nîhthâkichi go outside; I’v

source: it my
sac: nethakipota nînaniwi I b

source: a Sa
sac: Thâkîwa Othâkîwa (or )

source: f Okl
sac: member of the Sac & Fox o

source: ker of
sac: Thâkiwâtowâchiki ) spea

source: Sauk;
sac: thâkiwâtowêwa speak

source: speak
sac: kethâkiwâtowe? do you

source: we? c
sac: kenahithâkiwâto Sauk?;

source: wâto
sac: nethâki you speak Sauk?;

source: shi)
sac: âkwi ( pa I speak Sauk; or

source: n’t spe
sac: thâkiwâtowêyânini I do

source: k, the
sac: Thâkiwâtowêweni Sau

source: c & F
sac: thâkîwiwa be a Sauk, Sa

source: ri);
sac: Oklahoma or of the Missou

source: uk (or,
sac: nethâkîwipena we’re Sa

source: to:
sac: including the person talked

source: chiw
sac: wâkîwa nama turn;

source: ! take
sac: mayâwiwâkîno left!;

source: GE
sac: S L OF THE AUK ANGUA

source: be a
sac: wâkoshêhithowa

source: hith
sac: newâkoshê Fox clan;

source: osed
sac: wânahkwîha hog-n

source: f bed
sac: wanâkîwa get out o

source: press
sac: wânâtethiwa be de

source: h ) fo
sac: wanîhkânêwa n/s (

source: nan.,
sac: wanîhkêwa forget i

source: îhke
sac: newan of one’s mind;

source: did y
sac: kewanîhke? I forgot;

source: â (or
sac: netâhkowiwanîhke

source: every
sac: newanîhke ) I forget

source: t, ge
sac: wanithowa be los

source: ki )
sac: wâpake wâpa (or

source: , o
sac: wâpamêwa watch

source: loo
sac: wâpamôni mirror,

source: ION
sac: 126 A C D ONCISE ICT

source: Dela
sac: Wâpanahkîha a

source: be
sac: wâpânehkwêwa

source: k ;
sac: wâpanwi it’s dawn

source: h, o
sac: wâpatamwa watc

source: ht,
sac: wâpâtêwi (it)’s lig

source: h )
sac: wâpatônêwa n/s (

source: urry
sac: wâpehpowi it’s fl

source: a mo
sac: wâthêtepehkîwi it’s

source: ayligh
sac: wâthêyâwi it’s day, d

source: âthêy
sac: nekotenwi êhw light;

source: ak po
sac: wâwanâtowêwa spe

source: age
sac: unable to speak the langu

source: be mis
sac: wâwaneshkâhiwa

source: ) egg
sac: wâwani owâwani (or

source: bolts
sac: wâwâthêtonôki (pl.)

source: wâwa
sac: wâwiyâkahâtêkini

source: ; mes
sac: wâwiyâkatôhi things

source: âkatô
sac: mêmekenano wâwiy

source: mess!
sac: pick up (or clear up) the

source: an.;
sac: wâwiyâmêwa thank

source: o one
sac: kewâwiyâmene! thanks! (t

source: wa!
sac: kewâwiyâmenep person);

source: son)
sac: thanks! (to more than one per

source: used if a
sac: wê! ô! (or ) oh!, hey! (often

source: ou want to
sac: thought occurs to you, or if y

source: omething)
sac: draw someone’s attention to s

source: (female
sac: wê! wî! (or ) gosh!, oh my!

source: the north, to
sac: wêchikethîyâki north, in

source: h, in the
sac: wêchinâwahkwêki sout

source: in the west,
sac: wêchipakishimoki west,

source: wêchitawi!
sac: wêchitawi it’s wonderful;

source: east, to the
sac: wêchiwâpaki east, in the

source: turn on
sac: wêpwêwêkihêwa

source: melon
sac: wêshkihtâhi water

source: eap
sac: wêtakimowa be ch

source: Pueblo
sac: Wêtahpahônîha a

source: east, t
sac: wêtapaki east, in the

source: ê! wî! , )
sac: wêta’shkwê! w (or

source: eautifu
sac: wêwenethiwa be b

source: autiful
sac: wêwenetwi (it)’s be

source: , headd
sac: wêwêpenôni roach

source: 1 GE
sac: S L OF THE AUK ANGUA

source: ment ag
sac: wêyôthêha govern

source: mpany
sac: wîchi- together, in co

source: ree wi
sac: wîchitêhamêwa ag

source: agree w
sac: kewîchitêhamene I
